{
    "AnonymizingText": {
        "description": [
            "A project that attempts to remove author attribution by indentifying stylometry methods in written works.",
            "Written as my capstone project at California State University Monterey Bay.",
            "Implemented as a browser plugin using <a href=\"https://github.com/spencermountain/compromise\">compromise</a> for natural language processing.",
            "Testing was implemented using: <a href=\"https://github.com/SeleniumHQ/selenium\">selenium</a> for browser automation,",
            "<a href=\"https://github.com/pallets/flask\">flask</a> for serving a test website,",
            "<a href=\"https://github.com/praw-dev/praw\">praw</a> for scrapping reddit for test data",
            "and <a href=\"https://github.com/asweigart/pyautogui\">PyAutoGUI</a> for interacting with the browser's UI.",
            "Data was then analyzed using <a href=\"https://github.com/sloria/TextBlob\">textblob</a>."
        ],
        "url": "https://github.com/virustotalop/AnonymizingText"
    },
    "BLIS": {
        "description": [
            "While working on BLIS(Basic Laboratory Information System) I worked with a team to get the application ready",
            "to move from on premisis to cloud deployments. The team and I worked with our partners to ensure that the test", 
            "deployments went smoothly. While working on BLIS I learned a variety of skills, the most valuable of those being",
            "how to debug a legacy PHP application."
        ],
        "url": "https://github.com/C4G/BLIS"
    },
    "Crouton": {
        "description": [
            "A wrapper for Kotlin's coroutines or light weight threads.",
            "Allows users to use Kotlin coroutines in their Java code by creating a wrapper in Kotlin that can be easily used",
            "in Java code. Crouton was written due to Java not having any implemention of light weight threads such as: coroutines, fibers or green threads.",
            "With Crouton millions of coroutines can be spawned where as with threads the user can easily run out of threads even with thread pooling.",
            "Crouton is in use in Obbylang currently but can be easily used in any project that wishes to use coroutines."
        ],
        "url": "https://github.com/ClubObsidian/crouton"
    },
    "DynamicGui": {
        "description": [
            "A plugin that make writing menus for Minecraft easy.",
            "Supports gui files written in yaml, json, hocon and xml.",
            "Provides a number of functions including: a full function treeing system, think else and ifs in programming,",
            "a macro system that was inspired by macros in C++, an animation system that allows users to animate:",
            "inventory items, item name, item lore, custom models and any other attribute that an item can have, sending players over proxies",
            "such as Bungeecord and Velocity, runtime replacers with PlaceholderAPi support and a lot more."
        ],
        "url": "https://www.github.com/ClubObsidian/DynamicGui"
    },
    "ObbyLang": {
        "description": [
            "A JavaScript toolkit for making content quickly. ObbyLang supports: Bukkit servers, Bungeecord, Velocity and Discord (JDA).",
            "Supports hot reloading of script files which speeds up development by a large amount.",
            "Also supports a number of needed tools such as: SQL databases, Redis, InfluxDB and MongoDB.",
            "Developed at ClubObsidian and has been deployed and in use for over 3 years.",
            "ObbyLang takes advantage of nashorn's ability to compile JavaScript down to lambdas for very fast execution. This speed",
            "has been tested with over 200,000 actions being executed every second with no slowdown to the Minecraft server."
        ],
        "url": "https://github.com/ClubObsidian/ObbyLang"
    },
    "Poseidon": {
        "description": [
            "A plugin platform that is to be eventually implemented in Hydra. Hydra is intended to be a resiliant, fault tolerant application server",
            "with plugin support."
        ],
        "url": "https://github.com/ClubObsidian/poseidon"
    },
    "Random.js": {
        "description": [
            "A port of Java's Random class to JavaScript. Random.js was created due to scavenger hunts that were hosted on ClubObsidian",
            "that I needed a port of Java's random class for <a href=\"https://clubobsidian.github.io/ctc/\">as seen here.</a>",
            "This was used to generate random values on the server and client side that would be the same without using any code that would",
            "communicate with the frontend."
        ],
        "url": "https://github.com/virustotalop/random.js"
    },
    "Trident": {
        "description": [
            "A fast eventbus that has support for multiple event bus implementations. Out of the box",
            "trident supports: reflection, methodhandler and generated bytecode eventbusses. Trident was written",
            "due to wanting a feature rich event bus that could be used in multiple applications and have support",
            "for different implementation types."
        ],
        "url": "https://github.com/ClubObsidian/trident"
    },
    "virustotalop.github.io": {
        "description": [
            "This website has been a labor of love of trying to push the limits of what is possible with",
            "running a website that has no backend while also trying to maintain fast page load times.",
            "There are quite a few features that I am proud of with this website: ",
            "a from scratch single page application framework, using only jQuery for page loading, that supports lazy loading and navigation buttons,",
            "a blog system from scratch using jQuery and <a href=\"https://github.com/showdownjs/showdown\">showdown</a> for markdown parsing",
            "and last but not least these code cards which get loaded in using jQuery which consumes a json file and then generates the code cards.",
            "There is also at least one easter egg on this website if you take a look at the source code!"
        ],
        "url": "https://github.com/virustotalop/virustotalop.github.io"
    },
    "Wrappy": {
        "description": [
            "A configuration library for yaml, xml, json and hocon.",
            "Written to have a simple way to load multiple configuration formats unified under one API.",
            "Used in ObbyLang, DynamicGui and a number of other projects."
        ],
        "url": "https://github.com/ClubObsidian/wrappy"
    }
}